# ToposolidElevationAtBottom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ToposolidElevationAtBottom Property
ParameterTypeId Class See Also
---
"Elevation at Bottom"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ToposolidElevationAtBottom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidElevationAtBottom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ToposolidElevationAtBottom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace